tap "adoptopenjdk/openjdk"
tap "dart-lang/dart"
tap "datawire/blackbird"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "mongodb/brew"
tap "nats-io/nats-tools"
tap "typesense/tap"
tap "wabarc/wayback"
brew "python@3.12"
brew "asciinema"
brew "ast-grep"
brew "awscli"
brew "bat"
brew "glib"
brew "cloc"
brew "cmake"
brew "openldap"
brew "curl"
brew "dnsmasq"
brew "docker"
brew "docker-compose"
brew "exa"
brew "expect"
brew "fastgron"
brew "fd"
brew "gnutls"
brew "harfbuzz"
brew "libass"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gdk-pixbuf"
brew "ghc"
brew "git"
brew "pkg-config"
brew "gobject-introspection"
brew "golangci-lint"
brew "gpgme"
brew "netpbm"
brew "librsvg"
brew "graphviz"
brew "protobuf"
brew "grpc"
brew "grpcurl"
brew "htop"
brew "imagemagick"
brew "jj"
brew "jq"
brew "kcat"
brew "ko"
brew "krb5"
brew "kubernetes-cli"
brew "kubectx"
brew "llvm"
brew "python@3.9"
brew "make"
brew "micro"
brew "mr"
brew "nats-server"
brew "ncdu"
brew "newt"
brew "ninja"
brew "nmap"
brew "pandoc"
brew "pass"
brew "pass-otp"
brew "pgcli"
brew "poetry"
brew "poppler"
brew "postgresql@15", restart_service: true
brew "protoc-gen-go-grpc"
brew "pyenv"
brew "rclone"
brew "redis"
brew "restic"
brew "ripgrep"
brew "ripgrep-all"
brew "rsync"
brew "rust"
brew "rustup-init"
brew "sqlc"
brew "tldr"
brew "tmux"
brew "trash"
brew "virtualenv", link: false
brew "watch"
brew "wget"
brew "xclip"
brew "yarn"
brew "yt-dlp"
brew "zoxide"
brew "zsh"
brew "nats-io/nats-tools/nats"
cask "monitorcontrol"
cask "obsidian"
cask "orbstack"
cask "spotify"
